In [1]:
import pandas as pd 
# titanic.csv 를 데이터프레임으로 read  , encoding = "euc-kr"  

df = pd.read_csv('titanic.csv', encoding="euc-kr")

In [2]:
# 앞의 7개 행만 출력 
df.head(7)

,PassengerId,생존여부,객실등급,이름,성별,나이,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S

In [3]:
# 생존한 승객 중 여성의 나이와 객실 등급(pclass) 을 출력 
df.loc[(df['성별'] == 'female') & (df['생존여부'] ==1), ('나이','객실등급')]

       나이  객실등급
1    38.0     1
2    26.0     3
3    35.0     1
8    27.0     3
9    14.0     2
..    ...   ...
874  28.0     2
875  15.0     3
879  56.0     1
880  25.0     2
887  19.0     1

[233 rows x 2 columns]

In [4]:
#  생존한 승객 중 여성 수 
df.loc[(df['성별'] == 'female') & (df['생존여부'] ==1), ('PassengerId')].count()

233

In [5]:
#  전체 승객 중 여성 수  
df.loc[(df['성별'] == 'female'), ('PassengerId')].count()

314

In [6]:
#  생존한 승객 중 남성 수 
df.loc[(df['성별'] == 'male') & (df['생존여부'] ==1), ('PassengerId')].count()

109

In [7]:
# 전체 남성 승객 수 
df.loc[(df['성별'] == 'male'), ('PassengerId')].count()

577

In [8]:
#  생존한 승객 중 여성이면서 1등칸 객실 승객 수 
df.loc[
    (df['성별'] == 'female') & 
    (df['생존여부'] ==1) & 
    (df['객실등급']==1), ('PassengerId')].count()

91

In [9]:
#  생존한 승객 중 여성이면서 3등칸 객실 승객 수 
df.loc[
    (df['성별'] == 'female') & 
    (df['생존여부'] ==1) & 
    (df['객실등급']==3), ('PassengerId')].count()

72

In [10]:
# 1등칸 전체 여성승객 수 
df.loc[
    (df['성별'] == 'female') & 
    (df['객실등급']==1), ('PassengerId')].count()

94

In [11]:
# 3등칸 전체 여성 승객 수 
df.loc[
    (df['성별'] == 'female') & 
    (df['객실등급']==3), ('PassengerId')].count()

144

In [12]:
# 전체 승객 수  
df.loc[() ,('PassengerId')].count()

891

In [13]:
# 결측치 갯수
df.isnull().sum()

PassengerId      0
생존여부             0
객실등급             0
이름               0
성별               0
나이             177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [14]:
# 13세 미만 전체 승객 수 
df.loc[
    (df['나이']<13),('PassengerId') ].count()

69

In [15]:
# 생존한 13세 미만 전체 승객 수 
df.loc[
    (df['생존여부']==1) &
    (df['나이']<13),('PassengerId')].count()

40